[
  {
    "Location": "nigeria",
    "dateTime": "2025 10th Nov at 20:26",
    "Details": "Julie\n\nI had this friend that stayed in Maitama then. I was around 12, and then she used to come to my place for sleepovers a lot. I decided to go to her house so it wouldn’t look like the friendship was one-sided. With permission from my mum, I took a taxi to their house. Her parents had gone out so we got to play as much as we wanted. We fell asleep as soon as we got in since we were worn out from playing and running around. I suddenly woke up in the middle of the night because I heard footsteps, so I assumed her parents were back. Then I heard the footsteps above the ceiling which was startling since my friend’s room was on the top floor. So, I woke up and put on the light only to see what looked like footprints on the ceiling as if someone walked upside down. Afraid, I woke my friend, let us call her Gina, and she told me that her dad said the house used to be haunted 30 years ago, adding that they had prayed about it. What burst my head was that she seemed unbothered about it. I asked if she told her parents; she said it doesn’t happen when they’re home, and when she told them, they never believed. Omo, after that day, I never slept there again. I was scared to sleep alone at night for the longest time.",
    "Title": "Maitama Incident"
  },
  {
    "Location": "nigeria",
    "dateTime": "2025 3rd Nov at 19:28",
    "Details": "I am an architectural graduate, so when I was in secondary, I did a technical drawing course that required me to put in long hours to do excellent work. Sometimes, I had to stay back in class during Night prep to finish up on my work. One day, I was trying to finish up an assignment when I heard someone chuckle behind the class. I wasn’t someone who believed in scary boarding house stories, so I figured it was crazy juniors playing around. I heard it repeatedly; then I saw someone peeping. I got annoyed as I started wondering which junior would be playing tricks on me. I was so angry that I stepped out of the class only to see someone run past. I followed the person who entered the class besides mine. Inside, I heard my classmates’ voices but the room was empty. I immediately ran out as fast as my legs could carry me. I told my friends about the incident but they refused to believe me until they had a similar encounter. It’s like this thing had recorded our voices.",
    "Title": "Secondary sch"
  },
  {
    "Location": "nigeria",
    "dateTime": "2024 17th May at 20:33",
    "Details": "What was supposed to be a romantic evening turned into a real-life horror movie for me. I went to see my boyfriend in Kaduna; I stayed in Zaria. He was escorting me home when I saw a guy I knew very well who died three years ago. This guy stayed in our area and was very helpful to us in the neighbourhood. He would help everyone; his mum was a widow who couldn’t send him to school, so he depended on stipends from his errands. One day, we had this light issue and someone had to check the pole for us. This guy offered to help, that’s how he got electrocuted. He wasn’t taken to the hospital on time, so he died. I know he had passed away because we even saw burial posters, and his mum came to my house and discussed it. My neighbours all went for the burial. Fast-forward to the day I was walking with my boyfriend, and I sighted this guy in a different area. I told my boyfriend about it, and he said he would talk to the guy; he did this because he thought I was lying. I stood at the other side of the street. When my boyfriend crossed, he touched the guy on his shoulder and pointed towards me. The dead guy looked back and as soon as he saw me, he vanished. I immediately took to my heels. I had heard stories of people reappearing after they died, which i never believed until this happened to me.",
    "Title": "Romantic horror"
  },
  {
    "Location": "Dayton, Ohio",
    "dateTime": "2008 18th Jan at 02:00",
    "Details": "Jeff, a resident of Dayton, Ohio, was driving with his 3-year-old son, Miles, in the back seat, when they passed by a modest cemetery decorated with only flowers and small plaques.\n\n“It basically looks like a giant garden,” Jeff explains on the podcast “Monsters Among Us.”\n\nAccording to Jeff, as they drove by, his toddler, who’d been happily singing, abruptly stopped, pointed to the cemetery and exclaimed, “Look at all those people!”\n\nJeff turned to look, but didn’t see a soul. Confused, he asked Miles what he was talking about. “All those people over there,” his son replied. “There sure are a lot of grandmas.”\n\nAs Jeff tells it, chills ran down his spine as he asked his son what the people were doing. “They’re all standing there, looking down at the grass,” Miles said.\n\nCompletely unsettled by the conversation, Jeff sped up and drove home. Later that same day, he says his young son was watching TV when he turned to Jeff and said, “You know … they weren’t alive.”\n\nThinking Miles was referring to the cartoon, Jeff asked what he meant. “Those people we saw ... they were all paused,” his son replied.\n\n“I don’t know if my kid has the sixth sense,” Jeff says. “Or if he just has a wild imagination.”",
    "Title": "Grandma's Cemetery"
  },
  {
    "Location": "Estes Park, Colorado",
    "dateTime": "1994 18th Aug at 04:06",
    "Details": "The Stanley Hotel in Estes Park, Colorado, has been around for more than 100 years and was built as a posh getaway for the wealthy seeking solitude in the mountains.\n\nAs the years passed, however, occupancy declined, and by the 1970s, the grand hotel had fallen into disrepair. It was around that time that famed author Stephen King spent the night there and was inspired to write the book “The Shining.”\n\nThe book and blockbuster film helped return the Stanley to its former glory. Now, guests come in droves to see the hotel that inspired one of the scariest horror movies of all time.\n\nGiven its history, it should come as no surprise that many visitors report strange happenings. Aware of the ghostly rumors, Texas resident Henry Yau booked a last-minute getaway in April of 2016 to “check it out.”\n\nAfter arriving, Yau had dinner, then wandered around the Stanley to take photos. Stopping at the staircase, he waited for people to clear the area, then took a picture, thinking nothing of it.\n\nLater that night, however, Yau fell seriously ill. “I felt really sick, I had the shivers, I was like, something’s really wrong,” he tells TODAY.com. His companion suggested he go to the emergency room, but Yau refused.\n\nOn the trip home, Yau began swiping through the photos he’d taken when he discovered what he said was a “really, really strange image” of someone standing on the stairs.\n\nExcept no one had been there.\n\nThe next day, he posted the photo on Instagram, half-joking that he’d captured a ghost — and the world took notice. Almost overnight, Yau found himself in the limelight with his ghost picture warranting attention from global media outlets and paranormal experts who wanted to examine the photo.\n\n“Some experts say that there’s two ghosts, and other people said that the reason I got sick is because the ghost was trying to materialize, taking energy out of me,” he said. “There’s so many theories about this.”\n\nAnd what does Yau think? “I have no idea,” he says with a laugh.",
    "Title": "The Ghost of The Stanley Hotel"
  },
  {
    "Location": "France",
    "dateTime": "2025 6th Nov at 06:11",
    "Details": "baby we king loose it all",
    "Title": "circle back"
  },
  {
    "Location": "United Kingdom",
    "dateTime": "2025 3rd Nov at 05:11",
    "Details": "focused like i'm out here tying to get my fast",
    "Title": "shaking"
  },
  {
    "Location": "Holland",
    "dateTime": "2025 6th Nov at 07:19",
    "Details": "never be enough ...never never ...never enough",
    "Title": "Never Enogh"
  },
  {
    "Location": "nigeria",
    "dateTime": "2025 5th Nov at 05:31",
    "Details": "no airr...tell me how",
    "Title": "no air "
  }
]